# ========================================= HOME Work 3 ===========================================

# =================================== Модуль 3. Функції ==========================================
# Функція — це окремий блок чи фрагмент програми. Вони служать у програмах декільком цілям. Головна ціль в тому, що код пишеться раз, 
# і після цього ми можемо звертатися до нього з різних місць програми багаторазово. За допомогою функцій легко тестувати різні рішення.
# Функції приховують деталі реалізації рішення і ми просто працюємо з ними, майже як з операторами.

# Сам блок функції з його реалізацією називається визначенням (defining), а коли ми звертаємося до функції,
# то говоримо, що викликаємо функцію (calling). Після виклику та виконання функції управління повертається в основну програму, 
# і виконання програми продовжується одразу після того місця, де відбувся виклик. Ми вже стикалися з функціями input, int, float тощо.

# Визначення функції починається з ключового слова def, після має йти ім'я функції, далі дужка, що відкриває (, дужка, що закриває )
# і знак двокрапки :. Тіло функції починається з нового рядка з потрібним відступом. Python вважає, що знайшов кінець тіла функції, 
# як тільки відступ у рядку стане такого ж рівня, як в оператора def

# def hello():
#     print('Hello user!')
# Саме визначення функції не змусить код виконатись, необхідно виконати виклик функції




# =================================== Завданна 1 /Task 1 =========================================

# ++++++++++++++++++++++++++++++++++++++Умова / Condition ++++++++++++++++++++++++++++++++++++++++

# Створіть функцію greeting, яка всередині виводить вітальне повідомлення print('Hello world!'). 
# І викличте її.

# ++++++++++++++++++++++++++++++++++  Код /Code  +++++++++++++++++++++++++++++++++++++++++++++++++

# def greeting () :        # оголошення функції greeting () через *def яка при виклику буде виводит на екран 'Hello world!'. Оголошення відбувається через 
   
#    print('Hello world!') #Тіло функції  (вньому будемо виводити на екран повідомлення *"Hello world!"")


# greeting()         #Виклки Самої функції в коді.



# =================================== Завданна 2 /Task 2 =========================================

# ++++++++++++++++++++++++++++++++++++++Умова / Condition ++++++++++++++++++++++++++++++++++++++++

# Нехай нам необхідно створити розсилку запрошень на якийсь захід. 
# Повідомлення для кожного учасника однакове, нам необхідно міняти лише ім'я запрошеного. 
# Цілком очевидно, що для формування такого повідомлення краще використовувати функцію. 
# Створіть функцію invite_to_event, яка приймає ім'я запрошеного username і повертатиме наступний f-рядок:

# "Dear {username}, we have the honour to invite you to our event".


# ++++++++++++++++++++++++++++++++++  Код /Code  +++++++++++++++++++++++++++++++++++++++++++++++++


def invite_to_event(username): # Фунція отримує дані *username  і повертає напис з вказнаим текстом де підставля отримані дані в текс в відповідне місце. 
    
    masage = f"Dear {username}, we have the honour to invite you to our event" # змінії *masage присвоюємо текст з відповідними даними отриманими в *username
    return masage  # Повертаємо модифікована повідомлення з функції.

username = "Andrew" # приклад для тесту.

print ( invite_to_event (username) ) # вивід на екран тексут відповідно до вимого завдання.